
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидДоговораПриИзмененииНаСервере();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
	
	ГруппаПериод = ЭтаФорма.Элементы.Добавить("АбонентскоеОбслуживание", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаШапкиПраво);
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Авто;

	ПолеВвода = ЭтаФорма.Элементы.Добавить("ПериодС", Тип("ПолеФормы"),ГруппаПериод);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
	
	ПолеВвода = ЭтаФорма.Элементы.Добавить("По", Тип("ПолеФормы"), ГруппаПериод);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	
	ПолеВвода = ЭтаФорма.Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаШапкиПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
	ПолеВвода = ЭтаФорма.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаШапкиПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

