
#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьГруппуКнопкуИКоманду(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьГруппуКнопкуИКоманду(Форма)
	
	Группа = Форма.Элементы.Добавить("ТЧ", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;	
	
	Команда = Форма.Команды.Добавить("ЗаполнитьТЧ");
	Команда.Заголовок = "ЗаполнитьТЧ_Услуги";
	Команда.Действие = "ВКМ_Заполнить";
	
	КнопкаФормы = Форма.Элементы.Добавить("ЗаполнитьТЧ", Тип("КнопкаФормы"), Группа);
	КнопкаФормы.ИмяКоманды = "ЗаполнитьТЧ";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Картинка = БиблиотекаКартинок.ЗаполнитьФорму;
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры

#КонецОбласти
