#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТЧИСоздатьРеализации(Команда)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	
	ДлительнаяОперация = ЗаполнитьТЧИСоздатьРеализацииНаСервере();
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьТЧИСоздатьРеализацииНаСервере()

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ДлительнаяОперация =  ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СозданиеРеализацийЗаПериод", 
									Объект.ПериодОбработки.ДатаНачала, Объект.ПериодОбработки.ДатаОкончания);  
									
	Возврат ДлительнаяОперация;	
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВывестиРезультат(Результат.АдресРезультата);
	
КонецПроцедуры


Процедура ВывестиРезультат(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого СтрокаРез Из Результат Цикл
		НовСтрока = Объект.СписокДокументов.Добавить();
		НовСтрока.Договор = СтрокаРез.Договор;
		НовСтрока.ДокументРеализации = СтрокаРез.ДокументРеализации;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

