
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокументыОбслуживанияКлиента(Команда)
	ПровестиДокументыОбслуживанияКлиентаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПровестиДокументыОбслуживанияКлиентаНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПровестиДокументыЗаПериод(ОбработкаОбъект.ПериодОбработки.ДатаНачала, 
	                                       ОбработкаОбъект.ПериодОбработки.ДатаОкончания);
	
КонецПроцедуры
#КонецОбласти