
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВКМ_КоличествоДнейОтпускаПоПлану
	Движения.ВКМ_КоличествоДнейОтпускаПоПлану.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_КоличествоДнейОтпускаПоПлану.Добавить();
		Движение.Период = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.КоличествоДней =  (ТекСтрокаОтпускаСотрудников.ДатаОкончания - ТекСтрокаОтпускаСотрудников.ДатаНачала) / 86400;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
