
#Область СлужебныеПроцедурыИФункции
Процедура ПровестиДокументыЗаПериод(НачалоПериода, КонецПериода) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка,
	               |	ВКМ_ОбслуживаниеКлиента.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	               |ГДЕ
	               |	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ВКМ_ОбслуживаниеКлиента.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МоментВремени";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий()Цикл
		
		Если НЕ Документы.ВКМ_ОбслуживаниеКлиента.ПровестиДокументы(Выборка.Ссылка) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

