
#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСообщенияДляТелеграмБота() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	НЕ ВКМ_УведомленияТелеграмБоту.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СоединениеHTTP = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
			
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
        	AccessToken = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();

			ТекстОтветаJSON = СоединениеHTTP.Получить(Новый HTTPЗапрос("bot" + AccessToken + "/sendMessage")).ПолучитьТелоКакСтроку();
			
			//После операции две строчки кода выше можно закомментировать
			ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

			//Отправляем сообщение с указанными AccessToken, ChatId и ТекстСообщения
			ОтправкаВТелеграм = Новый HTTPСоединение("api.telegram.org",443,,,,15,Новый ЗащищенноеСоединениеOpenSSL());
			ОтветHTTP = ОтправкаВТелеграм.Получить(Новый HTTPЗапрос("bot" + AccessToken + "/sendMessage?chat_id=" + ИдентификаторЧата + "&text=" + Выборка.ТекстСообщения));
			
			Если ОтветHTTP.КодСостояния = 200 Тогда
				СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
				СообщениеОбъект.Удалить();
			Иначе
				РезультатЗапроса = ФорматироватьJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
				Сообщить(РезультатЗапроса.description);
			КонецЕсли;
    Исключение
        // Здесь может быть обработчик ошибки или вход в резервную функцию
	КонецПопытки
	
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПолучитьСообщения()Экспорт 

	СоединениеHTTP = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL(),);
	
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.Заголовки.Вставить("Content-Type","application/json");
	ЗапросHTTP.АдресРесурса = "bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/" + "sendMessage";
	
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	Если ОтветHTTP.КодСостояния = 200 Тогда
		РезультатЗапроса = ФорматироватьJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
КонецПроцедуры

Функция ФорматироватьJSON(СтрокаJSON)Экспорт 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись,ОбъектJSON);	
	Запись.Закрыть();
	
	Возврат ОбъектJSON;
	
КонецФункции


Функция ОбработатьСообщение(ДанныеСообщения)	
	
	ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Если ДанныеСообщения.Свойство("text")Тогда
		ТекстСообщения = ДанныеСообщения.text;
	Иначе
		ТекстСообщения = "Пустое сообщение @";
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("method","sendMessage");
	ДанныеОтвета.Вставить("chat_id",ИдентификаторЧата);
	ДанныеОтвета.Вставить("text",ТекстСообщения);
	
	Возврат ФорматироватьJSON(ДанныеОтвета);
	
КонецФункции

#КонецОбласти
